In [1]:
import numpy as np
import pandas as pd

In [4]:
date_initial = pd.read_csv("orders.csv")
time_initial = pd.read_csv("messages.csv")

In [5]:
date_initial.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [6]:
time_initial.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [17]:
date_initial = date
time_initial = time

### Working with date

In [18]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1000 non-null   datetime64[ns]
 1   product_id     1000 non-null   int64
 2   city_id        1000 non-null   int64
 3   orders         1000 non-null   int64
 4   date_year      1000 non-null   int32
 5   date_month_no  1000 non-null   int32
 6   date_month     1000 non-null   object
dtypes: datetime64[ns](1), int32(2), int64(3), object(1)
memory usage: 47.0+ KB

In [19]:
# Since our dataset, 'date' column is an object so we need to convert it in date-time datatype

In [20]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [21]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           1000 non-null   datetime64[ns]
 1   product_id     1000 non-null   int64
 2   city_id        1000 non-null   int64
 3   orders         1000 non-null   int64
 4   date_year      1000 non-null   int32
 5   date_month_no  1000 non-null   int32
 6   date_month     1000 non-null   object
dtypes: datetime64[ns](1), int32(2), int64(3), object(1)
memory usage: 47.0+ KB

In [22]:
# now it has been changed to datetime64[ns]

#### Extract year

In [23]:
date['date_year'] = date['date'].dt.year

#### Extract month

In [24]:
date['date_month_no'] = date['date'].dt.month

In [25]:
date['date_month'] = date['date'].dt.month_name()

In [26]:
date.head()

        date  product_id  city_id  orders  date_year  date_month_no date_month
0 2019-12-10        5628       25       3       2019             12   December
1 2018-08-15        3646       14     157       2018              8     August
2 2018-10-23        1859       25       1       2018             10    October
3 2019-08-17        7292       25       1       2019              8     August
4 2019-01-06        4344       25       3       2019              1    January

#### Extract days

In [30]:
date['date_day'] = date['date'].dt.day

In [50]:
# dow = day of week
date['date_dow'] = date['date'].dt.dayofweek
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

In [49]:
# checking if that date is weekend or not
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1, 0)
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extract quarter

In [48]:
date['quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extract Semester

In [53]:
date['semester'] = np.where(date['quarter'].isin([1, 2]), '1st sem', '2nd sem')
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,4,2nd sem
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,3,2nd sem
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,4,2nd sem
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,3,2nd sem
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1st sem

### Working with time

In [58]:
time.head(2)

                 date                                               msg  hour
0 2013-12-15 00:50:00                          ищу на сегодня мужика 37     0
1 2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826    23

In [54]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [55]:
# Converting to datetime dateatype
time['date'] = pd.to_datetime(time['date'])

In [56]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [60]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head(3)

,date,msg,hour,minute,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0

#### Extract time part only

In [63]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,minute,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00